In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\SqyUser\Desktop\learning Classes\Python\vaibhav.csv")

In [3]:
df.head()

,SL\nNO,POSN,CODE,DESCRIPTION,TYPE,GROOVE,EXTERNAL SHADE,PANEL CORE,INTERNAL SHADE,BOARD NAME,...,Bot Lam Markup,Bot Lam Wastage,Bot Lam \nPrice,Edge Band \nBase Price,Edge Band\nLength,Edge Band\nPrice,Total Customer Price,Total Vendor Price,Percentage Vendor vs Customer,Unnamed: 42
0,1.0,M1,HW4S,Left Panel,Panel,G,Frosty White 22291(SF),MR - Green/Century or Equivalent,Frosty White 22291(SF),Frosty White 22291(SF)_18MR_Frosty White 22291...,...,1.95,1.25,607.18,63.45,5.44,345.17,"4,710.62",1948.78,41.37%,NaN
1,2.0,M1,HW4S,Right Panel,Panel,G,Frosty White 22291(SF),MR - Green/Century or Equivalent,Frosty White 22291(SF),Frosty White 22291(SF)_18MR_Frosty White 22291...,...,1.95,1.25,607.18,63.45,5.44,345.17,"4,710.62",1948.78,41.37%,NaN
2,3.0,M1,HW4S,Top Panel,Panel,G,Frosty White 22291(SF),MR - Green/Century or Equivalent,Frosty White 22291(SF),Frosty White 22291(SF)_18MR_Frosty White 22291...,...,1.95,1.25,452.20,63.45,4.37,277.15,"3,528.37",1456.19,41.27%,NaN
3,4.0,M1,HW4S,Bottom Panel,Panel,G,Frosty White 22291(SF),MR - Green/Century or Equivalent,Frosty White 22291(SF),Frosty White 22291(SF)_18MR_Frosty White 22291...,...,1.95,1.25,452.20,63.45,4.37,277.15,"3,528.37",1456.19,41.27%,NaN
4,5.0,M1,HW4S,Left Back Panel,Panel,NaN,Frosty White 22291(SF),MR - Green/Century or Equivalent,Frosty White 22291(SF),Frosty White 22291(SF)_8MR_Frosty White 22291(SF),...,1.95,1.25,775.42,0.00,0.00,0.00,"4,525.27",1883.61,41.62%,NaN

In [4]:
data = {"a" : [ 1,2,3,4],
        "b" : [4,5,6,7],
        "c" : [ "amit", "Krish" , "hitesh", "virat"]}

In [5]:
data

{'a': [1, 2, 3, 4],
 'b': [4, 5, 6, 7],
 'c': ['amit', 'Krish', 'hitesh', 'virat']}

In [6]:
pd.DataFrame(data)

   a  b       c
0  1  4    amit
1  2  5   Krish
2  3  6  hitesh
3  4  7   virat

In [7]:
df = pd.DataFrame(data)

In [16]:
df

        a  b
c
amit    1  4
Krish   2  5
hitesh  3  6
virat   4  7

In [18]:
data = {"a" : [ 1,2,3,4],
        "b" : [4,5,6,7],
        "c" : [ "amit", "Krish" , "hitesh", "virat"]}
df1 = pd.DataFrame(data,index = ['a','b','c','d'])

In [19]:
df1

   a  b       c
a  1  4    amit
b  2  5   Krish
c  3  6  hitesh
d  4  7   virat

In [20]:
df1.reindex(['b', 'c', 'a', 'd'])

   a  b       c
b  2  5   Krish
c  3  6  hitesh
a  1  4    amit
d  4  7   virat

In [21]:
df1.iterrows()

In [22]:
 for i in df1.iterrows():
     print(i)

('a', a       1
b       4
c    amit
Name: a, dtype: object)
('b', a        2
b        5
c    Krish
Name: b, dtype: object)
('c', a         3
b         6
c    hitesh
Name: c, dtype: object)
('d', a        4
b        7
c    virat
Name: d, dtype: object)

In [26]:
def test(x):
    return x.sum()
df1.apply(test, axis = 0)

a                      10
b                      22
c    amitKrishhiteshvirat
dtype: object

In [28]:
df2 = df1[ ['a', 'b']]

In [29]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [31]:
df2.applymap(lambda x : x**2)

C:\Users\SqyUser\AppData\Local\Temp\ipykernel_12916\4004635628.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df2.applymap(lambda x : x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [32]:
df1

   a  b       c
a  1  4    amit
b  2  5   Krish
c  3  6  hitesh
d  4  7   virat

In [33]:
df1.sort_values('c')

   a  b       c
b  2  5   Krish
a  1  4    amit
c  3  6  hitesh
d  4  7   virat

In [34]:
df1.sort_index(ascending = False)

   a  b       c
d  4  7   virat
c  3  6  hitesh
b  2  5   Krish
a  1  4    amit

In [37]:

df3 = pd.DataFrame({"desc" : ["jhdhcb ashjcbsdhchdhcbdshcbdshbchdsbchdsbcghdsvbcghdchgbdsghcgbsgbcsdhbchdscbhdsbchdbhdchb chxb chbnchbnbsdc hsdhc ndsb nd cb dnbchjnsdbcnsdbcsdncbnsdcb hsdncb sdcbdshbcsdhx"]})

In [38]:
df3

                                                desc
0  jhdhcb ashjcbsdhchdhcbdshcbdshbchdsbchdsbcghds...

In [42]:
pd.set_option("display.max_colwidth", 1500)
df3 = pd.DataFrame({"desc" : ["jhdhcb ashjcbsdhchdhcbdshcbdshbchdsbchdsbcghdsvbcghdchgbdsghcgbsgbcsdhbchdscbhdsbchdbhdchb chxb chbnchbnbsdc hsdhc ndsb nd cb dnbchjnsdbcnsdbcsdncbnsdcb hsdncb sdcbdshbcsdhx"]})

In [43]:
df3

                                                                                                                                                                            desc
0  jhdhcb ashjcbsdhchdhcbdshcbdshbchdsbchdsbcghdsvbcghdchgbdsghcgbsgbcsdhbchdscbhdsbchdbhdchb chxb chbnchbnbsdc hsdhc ndsb nd cb dnbchjnsdbcnsdbcsdncbnsdcb hsdncb sdcbdshbcsdhx

In [44]:
df3['char_len_data'] = df3['desc'].apply

In [45]:
df3

,desc,char_len_data
0,jhdhcb ashjcbsdhchdhcbdshcbdshbchdsbchdsbcghdsvbcghdchgbdsghcgbsgbcsdhbchdscbhdsbchdbhdchb chxb chbnchbnbsdc hsdhc ndsb nd cb dnbchjnsdbcnsdbcsdncbnsdcb hsdncb sdcbdshbcsdhx,"<bound method Series.apply of 0 jhdhcb ashjcbsdhchdhcbdshcbdshbchdsbchdsbcghdsvbcghdchgbdsghcgbsgbcsdhbchdscbhdsbchdbhdchb chxb chbnchbnbsdc hsdhc ndsb nd cb dnbchjnsdbcnsdbcsdncbnsdcb hsdncb sdcbdshbcsdhx\nName: desc, dtype: object>"

In [46]:
t = " I use to take the data science master class "
t.split()

['I', 'use', 'to', 'take', 'the', 'data', 'science', 'master', 'class']

In [48]:
df3['word_count'] = df3['desc'].apply(lambda x : len(x.split()))

In [49]:
df3

,desc,char_len_data,word_count
0,jhdhcb ashjcbsdhchdhcbdshcbdshbchdsbchdsbcghdsvbcghdchgbdsghcgbsgbcsdhbchdscbhdsbchdbhdchb chxb chbnchbnbsdc hsdhc ndsb nd cb dnbchjnsdbcnsdbcsdncbnsdcb hsdncb sdcbdshbcsdhx,"<bound method Series.apply of 0 jhdhcb ashjcbsdhchdhcbdshcbdshbchdsbchdsbcghdsvbcghdchgbdsghcgbsgbcsdhbchdscbhdsbchdbhdchb chxb chbnchbnbsdc hsdhc ndsb nd cb dnbchjnsdbcnsdbcsdncbnsdcb hsdncb sdcbdshbcsdhx\nName: desc, dtype: object>",11

In [50]:
df1['a']

a    1
b    2
c    3
d    4
Name: a, dtype: int64

In [51]:
df1['a'].mean()

2.5

In [52]:
df1['a'].median()

2.5

In [53]:
df1['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [54]:
df1['a'].std()

1.2909944487358056

In [55]:
df1['a'].min()

1

In [56]:
df1['a'].max()

4

In [57]:
df1['a'].sum()

10

In [58]:
df1['a'].var()

1.6666666666666667

In [59]:
# Python Window Functions

In [62]:
df4 = pd.DataFrame({'a':[1,2,3,4,5,6,7,8,9]})

In [63]:
df4

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [64]:
df4.rolling(window=1).mean()

     a
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0
8  9.0

In [65]:
df4.rolling(window=2).mean()

     a
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5
6  6.5
7  7.5
8  8.5

In [66]:
df4.cumsum()

    a
0   1
1   3
2   6
3  10
4  15
5  21
6  28
7  36
8  45

In [ ]:
# Python Dates - Pandas

In [67]:
pd.date_range(start = '2022-03-22', end = '2022-06-22')

DatetimeIndex(['2022-03-22', '2022-03-23', '2022-03-24', '2022-03-25',
               '2022-03-26', '2022-03-27', '2022-03-28', '2022-03-29',
               '2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06',
               '2022-04-07', '2022-04-08', '2022-04-09', '2022-04-10',
               '2022-04-11', '2022-04-12', '2022-04-13', '2022-04-14',
               '2022-04-15', '2022-04-16', '2022-04-17', '2022-04-18',
               '2022-04-19', '2022-04-20', '2022-04-21', '2022-04-22',
               '2022-04-23', '2022-04-24', '2022-04-25', '2022-04-26',
               '2022-04-27', '2022-04-28', '2022-04-29', '2022-04-30',
               '2022-05-01', '2022-05-02', '2022-05-03', '2022-05-04',
               '2022-05-05', '2022-05-06', '2022-05-07', '2022-05-08',
               '2022-05-09', '2022-05-10', '2022-05-11', '2022-05-12',
               '2022-05-13', '2022-05-14', '2022-05-15', '2022-05-16',
               '2022-05-17', '2022-05-18', '2022-05-19', '2022-05-20',
               '2022-05-21', '2022-05-22', '2022-05-23', '2022-05-24',
               '2022-05-25', '2022-05-26', '2022-05-27', '2022-05-28',
               '2022-05-29', '2022-05-30', '2022-05-31', '2022-06-01',
               '2022-06-02', '2022-06-03', '2022-06-04', '2022-06-05',
               '2022-06-06', '2022-06-07', '2022-06-08', '2022-06-09',
               '2022-06-10', '2022-06-11', '2022-06-12', '2022-06-13',
               '2022-06-14', '2022-06-15', '2022-06-16', '2022-06-17',
               '2022-06-18', '2022-06-19', '2022-06-20', '2022-06-21',
               '2022-06-22'],
              dtype='datetime64[ns]', freq='D')

In [77]:
data = pd.date_range(start ='2022-03-22' , end ='2022 -06-22')

In [78]:
data

DatetimeIndex(['2022-03-22', '2022-03-23', '2022-03-24', '2022-03-25',
               '2022-03-26', '2022-03-27', '2022-03-28', '2022-03-29',
               '2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06',
               '2022-04-07', '2022-04-08', '2022-04-09', '2022-04-10',
               '2022-04-11', '2022-04-12', '2022-04-13', '2022-04-14',
               '2022-04-15', '2022-04-16', '2022-04-17', '2022-04-18',
               '2022-04-19', '2022-04-20', '2022-04-21', '2022-04-22',
               '2022-04-23', '2022-04-24', '2022-04-25', '2022-04-26',
               '2022-04-27', '2022-04-28', '2022-04-29', '2022-04-30',
               '2022-05-01', '2022-05-02', '2022-05-03', '2022-05-04',
               '2022-05-05', '2022-05-06', '2022-05-07', '2022-05-08',
               '2022-05-09', '2022-05-10', '2022-05-11', '2022-05-12',
               '2022-05-13', '2022-05-14', '2022-05-15', '2022-05-16',
               '2022-05-17', '2022-05-18', '2022-05-19', '2022-05-20',
               '2022-05-21', '2022-05-22', '2022-05-23', '2022-05-24',
               '2022-05-25', '2022-05-26', '2022-05-27', '2022-05-28',
               '2022-05-29', '2022-05-30', '2022-05-31', '2022-06-01',
               '2022-06-02', '2022-06-03', '2022-06-04', '2022-06-05',
               '2022-06-06', '2022-06-07', '2022-06-08', '2022-06-09',
               '2022-06-10', '2022-06-11', '2022-06-12', '2022-06-13',
               '2022-06-14', '2022-06-15', '2022-06-16', '2022-06-17',
               '2022-06-18', '2022-06-19', '2022-06-20', '2022-06-21',
               '2022-06-22'],
              dtype='datetime64[ns]', freq='D')

In [79]:
df_date = pd.DataFrame({"date": data})

In [80]:
df_date

         date
0  2022-03-22
1  2022-03-23
2  2022-03-24
3  2022-03-25
4  2022-03-26
..        ...
88 2022-06-18
89 2022-06-19
90 2022-06-20
91 2022-06-21
92 2022-06-22

[93 rows x 1 columns]

In [81]:
df7 = pd.DataFrame({"date": ['2022-06-22', '2022-06-20', '2022-06-19']})

In [82]:
df7

         date
0  2022-06-22
1  2022-06-20
2  2022-06-19

In [83]:
df7.dtypes

date    object
dtype: object

In [89]:
 time = pd.Timedelta(days= 1, hours = 5 , minutes = 234)

In [90]:
time

Timedelta('1 days 08:54:00')

In [91]:
dt = pd.to_datetime('2022-06-20')

In [93]:
dt + time

Timestamp('2022-06-21 08:54:00')

In [ ]:
#Python Pandas - Categorical data
data = [ "sudh", "krish", "amit", "navin", "hitesh", "hitesh"]

In [97]:
cat = pd.Categorical(data)

In [98]:
cat.value_counts()

2022-03-22 00:00:00    1
2022-03-23 00:00:00    1
2022-03-24 00:00:00    1
2022-03-25 00:00:00    1
2022-03-26 00:00:00    1
                      ..
2022-06-18 00:00:00    1
2022-06-19 00:00:00    1
2022-06-20 00:00:00    1
2022-06-21 00:00:00    1
2022-06-22 00:00:00    1
Name: count, Length: 93, dtype: int64